# cask_args appdir: "/Applications"

# Casks (brew ls -1 --cask)
cask "android-studio"
cask "appcleaner"
cask "blender"
cask "browserstacklocal"
cask "claude-code"
cask "coteditor"
cask "db-browser-for-sqlite"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "firefox"
cask "fontbase"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "iina"
cask "linear-linear"
cask "spline"
cask "ungoogled-chromium"
cask "visual-studio-code"
cask "zed"
cask "zoom"
cask "zulu"

# Formulae (brew ls -1 --formulae)
brew "bun"
brew "cocoapods"
brew "composer"
brew "curl"
brew "docker"
brew "docker-completion"
brew "docker-compose"
brew "ffmpeg"
brew "flac"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-filter-repo"
brew "git-lfs"
brew "imagemagick"
brew "jsongrep"
brew "mas"
brew "php@8.3"
brew "pnpm"
brew "pyenv"
brew "python-setuptools"
brew "qrencode"
brew "readline"
brew "requestly"
brew "ripgrep"
brew "sqlite"
brew "stripe-cli"
brew "zsh-autocomplete"

## Expo
cask "expo-orbit"
brew "cocoapods"
brew "watchman"

## Python/pyenv Build Dependencies (https://github.com/pyenv/pyenv/wiki#suggested-build-environment)
brew "openssl"
brew "readline"
brew "sqlite3"
brew "xz"
brew "tcl-tk@8"
brew "libb2"
brew "zstd"
brew "zlib"
brew "pkgconfig"

# Taps (brew tap)
tap "oven-sh/bun"

# Mac App Store (mas list)
mas "Amphetamine", id: 937984704
mas "Xcode", id: 497799835
