# cask_args appdir: "/Applications"

# Casks (brew ls -1 --cask)
cask "ableton-live-suite@10"
cask "affinity"
cask "android-studio"
cask "appcleaner"
cask "blender"
cask "claude"
cask "claude-code"
cask "coteditor"
cask "docker-desktop"
cask "ente"
cask "ente-auth"
cask "figma"
cask "fontbase"
cask "ghostty"
cask "github"
cask "iina"
cask "izotope-product-portal"
cask "native-access"
cask "linear-linear"
cask "logi-options+"
cask "mongodb-compass"
cask "obs"
cask "obsidian"
cask "proton-drive"
cask "proton-mail"
cask "proton-pass"
cask "protonvpn"
cask "the-unarchiver"
cask "touchdesigner"
cask "ungoogled-chromium"
cask "unity-hub"
cask "via"
cask "zed"

# Formulae (brew ls -1 --formulae)
brew "aws-amplify"
brew "bat"
brew "bun"
brew "caddy"
brew "cmake"
brew "curl"
brew "deno"
brew "dnsmasq"
brew "docker"
brew "docker-completion"
brew "docker-compose"
brew "encore"
brew "ffmpeg"
brew "flac"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-filter-repo"
brew "git-lfs"
brew "go"
brew "imagemagick"
brew "infisical"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "jsongrep"
brew "libpq"
brew "mas"
brew "mongosh"
brew "neovim"
brew "ollama"
brew "opencode"
brew "postgresql"
brew "pnpm"
brew "pyenv"
brew "python-setuptools"
brew "qrencode"
brew "railway"
brew "readline"
brew "requestly"
brew "ripgrep"
brew "ruff"
brew "rustup"
brew "sqlite"
brew "stripe-cli"
brew "tmux"
brew "tree"
brew "ty"
brew "typescript"
brew "uv"
brew "vcpkg"
brew "webp"
brew "yt-dlp"
brew "zsh-autocomplete"

## Expo
brew "cocoapods"
brew "watchman"

## Python/pyenv Build Dependencies (https://github.com/pyenv/pyenv/wiki#suggested-build-environment)
brew "openssl" 
brew "readline"
brew "sqlite3"
brew "xz"
brew "tcl-tk@8"
brew "libb2"
brew "zstd"
brew "zlib"
brew "pkgconfig"

# Taps (brew tap)
tap "encoredev/tap"
tap "oven-sh/bun"
tap "Arthur-Ficial/tap/apfel"

# Mac App Store (mas list)
mas "1Blocker", id: 1365531024
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "DaVinci Resolve", id: 571213070
mas "Kagi for Safari", id: 1622835804
mas "Reeder Classic.", id: 1529448980
mas "Xcode", id: 497799835
